{
    "works": [
        {
            "_id": 0,
            "company_name": "Aspen Technology, Houston",
            "role_name": "Software Developer Intern",
            "start_date": "May 2023",
            "end_date": "August 2023",
            "achievements": [
                "Implemented a proof of concept (POC) prototype for an early warning system, achieving a 10% reduction in offspec production and demonstrated its success through precise alerts for process health, contributing to continuous optimization.",
                "Engineered a proactive Machine Learning optimization algorithm, by integrating Artificial Intelligence capabilities to enable continuous optimization of operations and providing actionable insights to address potential issues before impacting production KPIs.",
                "Integrated and tested the prototype built using PyQt5, providing valuable insights into variability issues in process manufacturing and offering guidance to users for appropriate process adjustments.",
                "Earned recognition for the prototype's capability in elevating business value of the product."
            ],
            "languages": [
                "Python", "PyQt5"
            ],
            "tools": [
              "Visual Studio Code", "Jupyter"
            ],
            "libraries": [
                "scikit-learn",
                "matplotlib",
                "seaborn",
                "pandas",
                "NumPy"
            ],
            "links": [
                {
                    "icon": "university",
                    "linkname": "company website",
                    "website_link": "https://www.aspentech.com/en/",
                    "color": "#868686"
                },
                {
                    "icon": "blog",
                    "linkname": "blog",
                    "website_link": "https://www.aspentech.com/en/blog",
                    "color": "#868686"
                },
                {
                    "icon": "news",
                    "linkname": "news",
                    "website_link": "https://www.aspentech.com/en/news-listing",
                    "color": "#868686"
                }
            ]
        },
        {
            "_id": 1,
            "company_name": "Sparks Foundation, India",
            "role_name": "Data Science Intern",
            "start_date": "July 2021",
            "end_date": "Aug 2021",
            "achievements": [
                "Involved in building and fine-tuning machine learning models. This included selecting appropriate algorithms, optimizing hyperparameters, and enhancing model performance.",
                "gained proficiency in data collection, preprocessing, and cleaning. This involved working with large datasets, ensuring data quality, and transforming data into a suitable format for analysis.",
                "Applied various data analysis techniques to extract meaningful insights from complex datasets. This included statistical analysis, feature engineering, and data visualization."
            ],
            "impact": "impacts",
            "languages": ["Python"],
            "tools": ["Jupyter", "Visual Studio Code"],
            "libraries": [
                "scikit-learn",
                "matplotlib",
                "seaborn",
                "pandas",
                "NumPy"
            ],
            "links": [
                {
                    "icon": "university",
                    "linkname": "company website",
                    "website_link": "https://www.thesparksfoundationsingapore.org/",
                    "color": "#868686"
                }
            ]
        }
    ]
}